#include<iostream>


using namespace std;

int map[502][502];

//머리가 안좋으면 몸이 고생한다
int block[19][4][2] = {
	{{0, 0}, {0, 1}, {0, 2}, {0, 3}},
	{{0, 0}, {1, 0}, {2, 0}, {3, 0}},

	{{0, 0}, {1, 0}, {0, 1}, {1, 1}},

	{{0, 0}, {1, 0}, {1, 1}, {2, 1}},
	{{0, 0}, {0, 1}, {-1, 1}, {-1, 2}},
	{{0, 0}, {1, 0}, {0, 1}, {-1, 1}},
	{{0, 0}, {0, 1}, {1, 1}, {1, 2}},

	{{0, 0}, {1, 0}, {2, 0}, {1, -1}},
	{{0, 0}, {1, 0}, {2, 0}, {1, 1}},
	{{0, 0}, {0, 1}, {0, 2}, {1, 1}},
	{{0, 0}, {0, 1}, {0, 2}, {-1, 1}},

	{{0, 0}, {1, 0}, {2, 0}, {2, 1}},
	{{0, 0}, {1, 0}, {2, 0}, {2, -1}},
	{{0, 0}, {1, 0}, {2, 0}, {0, -1}},
	{{0, 0}, {1, 0}, {2, 0}, {0, 1}},
	{{0, 0}, {0, 1}, {0, 2}, {1, 2}},
	{{0, 0}, {0, 1}, {0, 2}, {-1, 2}},
	{{0, 0}, {0, 1}, {0, 2}, {-1, 0}},
	{{0, 0}, {0, 1}, {0, 2}, {1, 0}}
};

int result = 0;

int main()
{
	int n, m;

	cin >> n >> m;

	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < m; j++)
		{
			cin >> map[i][j];
		}
	}

	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < m; j++)
		{
			for (int k = 0; k < 19; k++)
			{
				int ny1 = i + block[k][1][0];
				int nx1 = j + block[k][1][1];

				int ny2 = i + block[k][2][0];
				int nx2 = j + block[k][2][1];

				int ny3 = i + block[k][3][0];
				int nx3 = j + block[k][3][1];

				if (ny1 >= n || ny2 >= n || ny3 >= n || nx1 >= m || nx2 >= m >> nx3 >= m)
					continue;
				if (ny1 < 0 || ny2 < 0 || ny3 < 0 || nx1 < 0 || nx2 < 0 || nx3 < 0)
					continue;

				int curSum = map[i][j] + map[ny1][nx1] + map[ny2][nx2] + map[ny3][nx3];

				if (curSum > result)
					result = curSum;
			}
		}
	}

	cout << result<<endl;
}